In [7]:
import pandas as pd
import numpy as np

In [8]:
%config IPCompleter.greedy=True

In [9]:
sozlukVerisi = {"Istanbul" : [30,20,np.nan],"Ankara" : [20,np.nan,40],"Izmir" : [10,20,12]}

In [10]:
havaDurumuDataframe =pd.DataFrame(sozlukVerisi)

In [11]:
havaDurumuDataframe

   Istanbul  Ankara  Izmir
0      30.0    20.0     10
1      20.0     NaN     20
2       NaN    40.0     12

In [12]:
havaDurumuDataframe.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     10

In [13]:
havaDurumuDataframe.dropna(axis = 1)

   Izmir
0     10
1     20
2     12

In [14]:
yeniVeri = {"Istanbul" : [30,20,np.nan],"Ankara" : [20,np.nan,40],"Izmir" : [10,20,12],"Antalya" : [45,np.nan,np.nan]}
yeniDataFrame =pd.DataFrame(yeniVeri)

In [15]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     10     45.0
1      20.0     NaN     20      NaN
2       NaN    40.0     12      NaN

In [16]:
yeniDataFrame.dropna(axis=1 ,thresh=2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     10
1      20.0     NaN     20
2       NaN    40.0     12

In [17]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     10     45.0
1      20.0    20.0     20     20.0
2      20.0    40.0     12     20.0

## GROUPBY

In [29]:
maasSozlugu ={"Departman" : ["Yazılım","Yazılım","Pazarlama","Finans","İnsan Kaynakları","Hukuk"],
              "Calısan Ismi " : ["Ahment","Mehmet","Atil","Burak","Zeynep","Fatma"],
              "Maas" : [100,200,00,400,500,600]}

In [30]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [31]:
maasDataFrame

          Departman Calısan Ismi   Maas
0           Yazılım        Ahment   100
1           Yazılım        Mehmet   200
2         Pazarlama          Atil     0
3            Finans         Burak   400
4  İnsan Kaynakları        Zeynep   500
5             Hukuk         Fatma   600

In [32]:
grubObjesi = maasDataFrame.groupby("Departman")

In [33]:
grubObjesi.count()

                  Calısan Ismi   Maas
Departman
Finans                        1     1
Hukuk                         1     1
Pazarlama                     1     1
Yazılım                       2     2
İnsan Kaynakları              1     1

In [34]:
grubObjesi.mean()

TypeError: agg function failed [how->mean,dtype->object]

In [35]:
grubObjesi.min()

                 Calısan Ismi   Maas
Departman
Finans                   Burak   400
Hukuk                    Fatma   600
Pazarlama                 Atil     0
Yazılım                 Ahment   100
İnsan Kaynakları        Zeynep   500

In [36]:
grubObjesi.max()

                 Calısan Ismi   Maas
Departman
Finans                   Burak   400
Hukuk                    Fatma   600
Pazarlama                 Atil     0
Yazılım                 Mehmet   200
İnsan Kaynakları        Zeynep   500

In [37]:
grubObjesi.describe()

                  Maas
                 count   mean        std    min    25%    50%    75%    max
Departman
Finans             1.0  400.0        NaN  400.0  400.0  400.0  400.0  400.0
Hukuk              1.0  600.0        NaN  600.0  600.0  600.0  600.0  600.0
Pazarlama          1.0    0.0        NaN    0.0    0.0    0.0    0.0    0.0
Yazılım            2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0
İnsan Kaynakları   1.0  500.0        NaN  500.0  500.0  500.0  500.0  500.0